In [34]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn import tree

In [7]:
#create a dataframe
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [38]:
#create a new dataframe with the required columns
new_df = df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns')
new_df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [41]:
#handle missing age variables
#find the median of the age
median_age = df['Age'].median()
median_age

28.0

In [57]:
#fill the missing age values with the missing age
new_df.fillna({'Age':median_age}, inplace=True)
new_df.head(7)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500
5         0       3    male  28.0   8.4583
6         0       1    male  54.0  51.8625

In [58]:
#use label encoding to transform the sex column since ML only works with numbers
sex_le = LabelEncoder()

new_df['sex_n'] = sex_le.fit_transform(new_df['Sex'])
new_df_n = new_df.drop(['Sex'], axis='columns')
new_df_n.head()

   Survived  Pclass   Age     Fare  sex_n
0         0       3  22.0   7.2500      1
1         1       1  38.0  71.2833      0
2         1       3  26.0   7.9250      0
3         1       1  35.0  53.1000      0
4         0       3  35.0   8.0500      1

In [59]:
x = new_df_n[['Pclass', 'Age', 'Fare', 'sex_n']]
y = new_df_n['Survived']

#split the data to training and test data
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.1)

In [60]:
#make a model
model = tree.DecisionTreeClassifier()

In [62]:
#train the model
model.fit(x_train, y_train)

DecisionTreeClassifier()

In [66]:
#check the score of the model
model.score(x_test, y_test)

0.8

In [69]:
#make a prediction
model.predict([[1, 38, 71.28, 0]])

array([1], dtype=int64)